# GetTargetRebarBendNumber Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstraint..::..GetTargetRebarBendNumber Method
RebarConstraint Class See Also
---
Returns the number of the bend on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType must be 'BarBend.' Rebar must be Shape Driven Rebar element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int GetTargetRebarBendNumber()
```

Visual Basic
---
```text
Public Function GetTargetRebarBendNumber As Integer
```

Visual C++
---
```text
public:
int GetTargetRebarBendNumber()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.' -or- The RebarTargetConstraintType is not 'BarBend' -or- Constrained rebar is a free form rebar element. |

# See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace